<template>
  <div class="footer">
    <div class="footer__info">
      <div class="info--column">
        <h3>
          <span @click="toggleShowInfo('company')" >КОМПАНИЯ</span>
           <svg xmlns="http://www.w3.org/2000/svg" width="14" height="14" viewBox="0 0 14 14" fill="none">
            <path d="M7.48584 7.88906L11.3749 4L12.4858 5.11094L7.48584 10.1109L2.48584 5.11094L3.59678 4L7.48584 7.88906Z" fill="#E0BEA2"/>
          </svg>
        </h3>
        <div
            v-if="showInfo.company || windowWidth > 800"
            class="info--column"
        >
          <p>О нас</p>
          <p>Контакты</p>
        </div>
      </div>
      <div class="info--column">
        <h3>
          <span @click="toggleShowInfo('usufel')" >ПОЛЕЗНОЕ</span>
          <svg xmlns="http://www.w3.org/2000/svg" width="14" height="14" viewBox="0 0 14 14" fill="none">
            <path d="M7.48584 7.88906L11.3749 4L12.4858 5.11094L7.48584 10.1109L2.48584 5.11094L3.59678 4L7.48584 7.88906Z" fill="#E0BEA2"/>
          </svg>
        </h3>
        <div
            v-if="showInfo.usufel || windowWidth > 800"
            class="info--column"
        >
          <p>Оплата и доставка</p>
          <p>Условия возврата</p>
          <p>Бонусная система</p>
        </div>
      </div>
      <div class="info--column">
        <h3>
          <span @click="toggleShowInfo('toBuyer')">ПОКУПАТЕЛЮ</span>
          <svg xmlns="http://www.w3.org/2000/svg" width="14" height="14" viewBox="0 0 14 14" fill="none">
            <path d="M7.48584 7.88906L11.3749 4L12.4858 5.11094L7.48584 10.1109L2.48584 5.11094L3.59678 4L7.48584 7.88906Z" fill="#E0BEA2"/>
          </svg>
        </h3>
        <div
            v-if="showInfo.toBuyer || windowWidth > 800"
            class="info--column"
        >
          <p>Избранное</p>
          <p>Публичная оферта</p>
          <p>Политика конфиденциальности</p>
        </div>
      </div>
      <div class="info--column">
        <h3>
          <span>КОНТАКТЫ</span>
        </h3>
        <div>
          <svg xmlns="http://www.w3.org/2000/svg" width="19" height="19" viewBox="0 0 19 19" fill="none">
            <g clip-path="url(#clip0_1_214)">
              <path d="M9.50004 7.12492C8.87015 7.12492 8.26606 7.37514 7.82066 7.82054C7.37526 8.26594 7.12504 8.87003 7.12504 9.49992C7.12504 10.1298 7.37526 10.7339 7.82066 11.1793C8.26606 11.6247 8.87015 11.8749 9.50004 11.8749C10.1299 11.8749 10.734 11.6247 11.1794 11.1793C11.6248 10.7339 11.875 10.1298 11.875 9.49992C11.875 8.87003 11.6248 8.26594 11.1794 7.82054C10.734 7.37514 10.1299 7.12492 9.50004 7.12492ZM9.50004 5.54159C10.5499 5.54159 11.5567 5.95862 12.299 6.70095C13.0413 7.44329 13.4584 8.4501 13.4584 9.49992C13.4584 10.5497 13.0413 11.5566 12.299 12.2989C11.5567 13.0412 10.5499 13.4583 9.50004 13.4583C8.45023 13.4583 7.44341 13.0412 6.70108 12.2989C5.95875 11.5566 5.54171 10.5497 5.54171 9.49992C5.54171 8.4501 5.95875 7.44329 6.70108 6.70095C7.44341 5.95862 8.45023 5.54159 9.50004 5.54159ZM14.6459 5.34367C14.6459 5.60612 14.5416 5.85783 14.356 6.04341C14.1705 6.22899 13.9187 6.33325 13.6563 6.33325C13.3938 6.33325 13.1421 6.22899 12.9565 6.04341C12.771 5.85783 12.6667 5.60612 12.6667 5.34367C12.6667 5.08122 12.771 4.82951 12.9565 4.64393C13.1421 4.45834 13.3938 4.35409 13.6563 4.35409C13.9187 4.35409 14.1705 4.45834 14.356 4.64393C14.5416 4.82951 14.6459 5.08122 14.6459 5.34367ZM9.50004 3.16659C7.54146 3.16659 7.22162 3.17213 6.31042 3.2125C5.68975 3.24179 5.27333 3.32492 4.887 3.47534C4.54342 3.60834 4.29562 3.76746 4.032 4.03188C3.78421 4.27128 3.5937 4.56355 3.47467 4.88688C3.32425 5.27479 3.24112 5.69042 3.21262 6.31029C3.17146 7.18429 3.16671 7.48988 3.16671 9.49992C3.16671 11.4585 3.17225 11.7783 3.21262 12.6895C3.24192 13.3094 3.32504 13.7266 3.47467 14.1122C3.60925 14.4565 3.76758 14.7043 4.03042 14.9672C4.29721 15.2332 4.545 15.3923 4.88542 15.5237C5.2765 15.6749 5.69292 15.7588 6.31042 15.7873C7.18442 15.8285 7.49 15.8333 9.50004 15.8333C11.4586 15.8333 11.7785 15.8277 12.6897 15.7873C13.3087 15.758 13.726 15.6749 14.1123 15.5253C14.4551 15.3915 14.7045 15.2324 14.9673 14.9695C15.2341 14.7028 15.3932 14.455 15.5246 14.1145C15.675 13.7243 15.759 13.307 15.7875 12.6895C15.8286 11.8155 15.8334 11.51 15.8334 9.49992C15.8334 7.54134 15.8278 7.2215 15.7875 6.31029C15.7582 5.69121 15.675 5.27321 15.5246 4.88688C15.4053 4.56388 15.2151 4.27172 14.9681 4.03188C14.7288 3.78396 14.4365 3.59343 14.1131 3.47454C13.7252 3.32413 13.3087 3.241 12.6897 3.2125C11.8157 3.17134 11.5101 3.16659 9.50004 3.16659ZM9.50004 1.58325C11.651 1.58325 11.9194 1.59117 12.7633 1.63075C13.6064 1.67034 14.1804 1.80254 14.6855 1.99888C15.208 2.19996 15.6481 2.47229 16.0883 2.91167C16.4909 3.30742 16.8023 3.78613 17.0011 4.3145C17.1966 4.81879 17.3296 5.39354 17.3692 6.23667C17.4064 7.08059 17.4167 7.34896 17.4167 9.49992C17.4167 11.6509 17.4088 11.9193 17.3692 12.7632C17.3296 13.6063 17.1966 14.1803 17.0011 14.6853C16.8029 15.214 16.4913 15.6928 16.0883 16.0882C15.6924 16.4906 15.2137 16.8021 14.6855 17.001C14.1812 17.1965 13.6064 17.3295 12.7633 17.3691C11.9194 17.4063 11.651 17.4166 9.50004 17.4166C7.34908 17.4166 7.08071 17.4087 6.23679 17.3691C5.39367 17.3295 4.81971 17.1965 4.31462 17.001C3.78605 16.8026 3.30725 16.4911 2.91179 16.0882C2.50915 15.6925 2.19765 15.2137 1.999 14.6853C1.80267 14.181 1.67046 13.6063 1.63087 12.7632C1.59367 11.9193 1.58337 11.6509 1.58337 9.49992C1.58337 7.34896 1.59129 7.08059 1.63087 6.23667C1.67046 5.39275 1.80267 4.81959 1.999 4.3145C2.1971 3.78581 2.50868 3.30696 2.91179 2.91167C3.30736 2.50889 3.78613 2.19737 4.31462 1.99888C4.81971 1.80254 5.39287 1.67034 6.23679 1.63075C7.08071 1.59354 7.34908 1.58325 9.50004 1.58325Z" fill="#E0BEA2"/>
            </g>
            <defs>
              <clipPath id="clip0_1_214">
                <rect width="19" height="19" fill="white"/>
              </clipPath>
            </defs>
          </svg>
          <svg xmlns="http://www.w3.org/2000/svg" width="19" height="19" viewBox="0 0 19 19" fill="none">
            <g clip-path="url(#clip0_1_217)">
              <path d="M9.50004 15.8333C11.1797 15.8333 12.7907 15.166 13.9784 13.9783C15.1661 12.7905 15.8334 11.1796 15.8334 9.49992C15.8334 7.82021 15.1661 6.20931 13.9784 5.02158C12.7907 3.83385 11.1797 3.16659 9.50004 3.16659C7.82034 3.16659 6.20943 3.83385 5.0217 5.02158C3.83397 6.20931 3.16671 7.82021 3.16671 9.49992C3.16671 11.1796 3.83397 12.7905 5.0217 13.9783C6.20943 15.166 7.82034 15.8333 9.50004 15.8333ZM9.50004 17.4166C5.12767 17.4166 1.58337 13.8723 1.58337 9.49992C1.58337 5.12754 5.12767 1.58325 9.50004 1.58325C13.8724 1.58325 17.4167 5.12754 17.4167 9.49992C17.4167 13.8723 13.8724 17.4166 9.50004 17.4166ZM7.03796 10.4262L5.06037 9.80946C4.63287 9.67884 4.6305 9.38434 5.15617 9.17296L12.8615 6.19629C13.3088 6.01421 13.5621 6.24459 13.4172 6.82171L12.1054 13.0125C12.0136 13.4535 11.7484 13.5588 11.3802 13.3553L9.36071 11.8607L8.41942 12.7695C8.32283 12.8629 8.24446 12.9429 8.09562 12.9627C7.94758 12.9833 7.82567 12.9389 7.73621 12.6935L7.04746 10.4206L7.03796 10.4262Z" fill="#E0BEA2"/>
            </g>
            <defs>
              <clipPath id="clip0_1_217">
                <rect width="19" height="19" fill="white"/>
              </clipPath>
            </defs>
          </svg>
        </div>
        <p>+38(073) 096 36 44</p>
        <p>info@yanki.com</p>
      </div>
    </div>
    <p>©️ 2021 Yanki. All rights reserved</p>
  </div>
</template>

<script setup>
import {onMounted, reactive, ref} from "vue";

onMounted(() => {
  window.addEventListener('resize', handleResize)
})

const showInfo = reactive({
  company: false,
  usufel: false,
  toBuyer: false,
});
const windowWidth = ref(window.innerWidth);

const toggleShowInfo = (menu) => {
  showInfo[menu] = !showInfo[menu];
}

const handleResize = () => {
  windowWidth.value = window.innerWidth;
}
</script>

<style lang="scss" scoped>
* {
  color: black;
  box-sizing: border-box;
}

.footer {
  margin-top: 4rem;
  display: flex;
  flex-direction: column;
  align-items: center;
  width: 100%;
  padding: 2rem 1rem;
  gap: 2.5rem;
}

.footer__info {
  display: flex;
  justify-content: space-between;
  width: 100%;
  max-width: 1200px;
  gap: 2rem;
}

.info--column {
  display: flex;
  flex-direction: column;
  gap: 0.75rem;
}

.info--column h3 {
  font-size: 1.25rem;
  font-weight: 300;
  margin-bottom: 0.5rem;
  color: #333;
}

.info--column h3 svg {
  display: none;
}

.info--column p {
  font-size: 1rem;
  font-weight: 200;
  color: #555;
  text-decoration: none;
  transition: color 0.3s ease;
}

.info--column p:hover {
  cursor: pointer;
  color: #E0BEA2;
}

@media (max-width: 800px) {
  .footer__info {
    flex-direction: column;
    align-items: center;
    gap: 1.5rem;
    text-align: center;
  }

  .footer__info :last-child p {
    display: block;
  }

  .footer__info :last-child {
    border-bottom: none;
  }

  .info--column {
    display: flex;
    width: 100%;
    max-width: 300px;
    border-bottom: 1px solid;
    margin-bottom: 1rem;
  }

  .info--column p {
    display: none;
  }

  .info--column h3 {
    display: flex;
    justify-content: space-between;
    align-items: center;
  }

  .info--column h3 span {
    flex: 1;
    text-align: center;
  }

  .info--column h3 svg {
    display: flex;
  }
}
</style>